; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	satellite1 - satellite
	instrument3 - instrument
	instrument4 - instrument
	instrument5 - instrument
	thermograph1 - mode
	spectrograph0 - mode
	spectrograph4 - mode
	thermograph3 - mode
	infrared2 - mode
	Star1 - direction
	GroundStation3 - direction
	GroundStation6 - direction
	Star4 - direction
	GroundStation2 - direction
	GroundStation5 - direction
	GroundStation0 - direction
	Star7 - direction
	Planet8 - direction
	Planet9 - direction
	Phenomenon10 - direction
	Phenomenon11 - direction
	Planet12 - direction
)
(:init
	(supports instrument0 spectrograph4)
	(calibration_target instrument0 Star1)
	(supports instrument1 thermograph1)
	(supports instrument1 spectrograph4)
	(supports instrument1 infrared2)
	(calibration_target instrument1 GroundStation2)
	(supports instrument2 thermograph3)
	(supports instrument2 infrared2)
	(supports instrument2 spectrograph0)
	(calibration_target instrument2 GroundStation2)
	(calibration_target instrument2 GroundStation3)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star7)
	(supports instrument3 thermograph3)
	(supports instrument3 spectrograph4)
	(supports instrument3 infrared2)
	(calibration_target instrument3 GroundStation6)
	(supports instrument4 thermograph1)
	(calibration_target instrument4 GroundStation2)
	(calibration_target instrument4 Star4)
	(supports instrument5 thermograph3)
	(supports instrument5 infrared2)
	(calibration_target instrument5 GroundStation0)
	(calibration_target instrument5 GroundStation5)
	(on_board instrument3 satellite1)
	(on_board instrument4 satellite1)
	(on_board instrument5 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star1)
)
(:goal (and
	(pointing satellite1 Star7)
	(have_image Star7 infrared2)
	(have_image Planet8 infrared2)
	(have_image Planet9 spectrograph4)
	(have_image Phenomenon10 thermograph1)
	(have_image Phenomenon11 thermograph3)
	(have_image Planet12 spectrograph0)
))

)

; plan
1. (turn_to satellite1 star7 star1)
   deleted: (pointing satellite1 star1)
   added: (pointing satellite1 star7)
   goals met: 1 of 7
2. (turn_to satellite0 groundstation2 star7)
   deleted: (pointing satellite0 star7)
   added: (pointing satellite0 groundstation2)
   goals met: 1 of 7
3. (switch_on instrument1 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 1 of 7
4. (calibrate satellite0 instrument1 groundstation2)
   added: (calibrated instrument1)
   goals met: 1 of 7
5. (turn_to satellite0 planet9 groundstation2)
   deleted: (pointing satellite0 groundstation2)
   added: (pointing satellite0 planet9)
   goals met: 1 of 7
6. (take_image satellite0 planet9 instrument1 spectrograph4)
   added: (have_image planet9 spectrograph4)
   goals met: 2 of 7
7. (turn_to satellite0 phenomenon10 planet9)
   deleted: (pointing satellite0 planet9)
   added: (pointing satellite0 phenomenon10)
   goals met: 2 of 7
8. (take_image satellite0 phenomenon10 instrument1 thermograph1)
   added: (have_image phenomenon10 thermograph1)
   goals met: 3 of 7
9. (switch_off instrument1 satellite0)
   deleted: (power_on instrument1)
   added: (power_avail satellite0)
   goals met: 3 of 7
10. (switch_on instrument2 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument2)
   goals met: 3 of 7
11. (turn_to satellite0 groundstation2 phenomenon10)
   deleted: (pointing satellite0 phenomenon10)
   added: (pointing satellite0 groundstation2)
   goals met: 3 of 7
12. (calibrate satellite0 instrument2 groundstation2)
   added: (calibrated instrument2)
   goals met: 3 of 7
13. (turn_to satellite0 phenomenon11 groundstation2)
   deleted: (pointing satellite0 groundstation2)
   added: (pointing satellite0 phenomenon11)
   goals met: 3 of 7
14. (take_image satellite0 phenomenon11 instrument2 thermograph3)
   added: (have_image phenomenon11 thermograph3)
   goals met: 4 of 7
15. (turn_to satellite0 planet12 phenomenon11)
   deleted: (pointing satellite0 phenomenon11)
   added: (pointing satellite0 planet12)
   goals met: 4 of 7
16. (take_image satellite0 planet12 instrument2 spectrograph0)
   added: (have_image planet12 spectrograph0)
   goals met: 5 of 7
17. (turn_to satellite0 planet8 planet12)
   deleted: (pointing satellite0 planet12)
   added: (pointing satellite0 planet8)
   goals met: 5 of 7
18. (take_image satellite0 planet8 instrument2 infrared2)
   added: (have_image planet8 infrared2)
   goals met: 6 of 7
19. (turn_to satellite0 star7 planet8)
   deleted: (pointing satellite0 planet8)
   added: (pointing satellite0 star7)
   goals met: 6 of 7
20. (take_image satellite0 star7 instrument2 infrared2)
   added: (have_image star7 infrared2)
   goals met: 7 of 7
